#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Version constraints inside provider configuration blocks are deprecated

  on gcp-gke/modules/terraform-google-kubernetes-engine/modules/beta-private-cluster-update-variant/auth.tf line 30, in provider "kubernetes":
  30:   version                = "~> 1.10, != 1.11.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Success! The configuration is valid, but there were some validation warnings as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-8CrB83y1ukLbrRjF

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
module.gke.module.cloud_nat.google_compute_router.router[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/routers/gke-router]
module.gke.google_compute_address.cloud_nat_ip: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/addresses/gke-nat]
module.gke.random_id.run_id: Refreshing state... [id=dpiDTw]
module.gke.module.primary-cluster.random_id.name["pool-01"]: Refreshing state... [id=j8M]
module.gke.module.cloud_nat.random_string.name_suffix: Refreshing state... [id=d9o5ho]
module.gke.module.primary-cluster.random_string.cluster_service_account_suffix: Refreshing state... [id=ubc7]
module.gke.module.primary-cluster.google_compute_firewall.master_webhooks[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-7698834f-webhooks]
module.gke.module.primary-cluster.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/logging.logWriter/serviceaccount:tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.google_project_iam_binding.compute-network-user: Refreshing state... [id=test-gcp-project-01-274314/roles/compute.networkUser]
module.gke.module.primary-cluster.google_compute_firewall.intra_egress[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-7698834f-intra-cluster-egress]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.metricWriter/serviceaccount:tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.viewer/serviceaccount:tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=test-terraform-project-01/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1-7698834f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke.module.bootstrap.helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.0.4"
      + wait                       = true

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # module.gke.module.bootstrap.helm_release.jaeger will be created
  + resource "helm_release" "jaeger" {
      + atomic                     = false
      + chart                      = "jaeger-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "jaeger-operator"
      + namespace                  = "observability"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jaegertracing.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.17.0"
      + wait                       = true

      + set {
          + name  = "jaeger.create"
          + value = "true"
        }
      + set {
          + name  = "rbac.clusterRole"
          + value = "true"
        }
    }

  # module.gke.module.bootstrap.null_resource.configure_kubectl will be created
  + resource "null_resource" "configure_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.download_kubectl will be created
  + resource "null_resource" "download_kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_operator will be created
  + resource "null_resource" "install_Elastic_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_IstioOperator_manifest will be created
  + resource "null_resource" "install_IstioOperator_manifest" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_istio_operator will be created
  + resource "null_resource" "install_istio_operator" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.set_kiali_credentials will be created
  + resource "null_resource" "set_kiali_credentials" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.setup_gcloud_cli will be created
  + resource "null_resource" "setup_gcloud_cli" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.cloud_nat.google_compute_router_nat.main will be created
  + resource "google_compute_router_nat" "main" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + min_ports_per_vm                   = 64
      + name                               = "cloud-nat-d9o5ho"
      + nat_ip_allocate_option             = "MANUAL_ONLY"
      + nat_ips                            = [
          + "https://www.googleapis.com/compute/v1/projects/test-gcp-project-01-274314/regions/asia-southeast2/addresses/gke-nat",
        ]
      + project                            = "test-gcp-project-01-274314"
      + region                             = "asia-southeast2"
      + router                             = "gke-router"
      + source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30
    }

  # module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "test-template-1-7698834f"
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "asia-southeast2"
      + max_pods_per_node   = (known after apply)
      + name                = "pool-01-8fc3"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "test-terraform-project-01"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name" = "test-template-1-7698834f"
              + "node_pool"    = "pool-01"
            }
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-2"
          + metadata          = {
              + "cluster_name"             = "test-template-1-7698834f"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "pool-01"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = "tf-gke-test-template-1-ubc7@test-terraform-project-01.iam.gserviceaccount.com"
          + tags              = [
              + "gke-test-template-1-7698834f",
              + "gke-test-template-1-7698834f-pool-01",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 2
          + max_unavailable = 1
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.run_command[0] will be created
  + resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = {
          + "arguments"             = "68b7078514406d62478d4b36d84d8ca1"
          + "create_cmd_body"       = "test-terraform-project-01 test-template-1-7698834f asia-southeast2 "
          + "create_cmd_entrypoint" = "gcp-gke/modules/terraform-google-kubernetes-engine/modules/beta-private-cluster-update-variant/scripts/wait-for-cluster.sh"
          + "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
          + "md5"                   = "c6c998c947403893bd888774e630eae2"
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.run_destroy_command[0] will be created
  + resource "null_resource" "run_destroy_command" {
      + id       = (known after apply)
      + triggers = {
          + "destroy_cmd_body"       = "test-terraform-project-01 test-template-1-7698834f asia-southeast2 "
          + "destroy_cmd_entrypoint" = "gcp-gke/modules/terraform-google-kubernetes-engine/modules/beta-private-cluster-update-variant/scripts/wait-for-cluster.sh"
          + "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

  # module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ca_certificate      = (sensitive value)
  ~ client_token        = (sensitive value)
  + kubernetes_endpoint = (sensitive value)

Warning: Version constraints inside provider configuration blocks are deprecated

  on gcp-gke/modules/terraform-google-kubernetes-engine/modules/beta-private-cluster-update-variant/auth.tf line 30, in provider "kubernetes":
  30:   version                = "~> 1.10, != 1.11.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*